       01 ACCOUNT-RECORD.
           05 ACCOUNT-ID              PIC 9(06).
           05 CUSTOMER-ID             PIC 9(05).
           05 ACCOUNT-TYPE            PIC X(10).
           05 ACCOUNT-BALANCE         PIC S9(11)V99.
           05 ACCOUNT-STATUS          PIC X(10).
           