       01 TRANSACTION-RECORD.
           05 TRANSACTION-ID          PIC 9(08).
           05 ACCOUNT-ID              PIC 9(06).
           05 TRANSACTION-TYPE        PIC X(10).
           05 TRANSACTION-AMOUNT      PIC 9(11)V99.
           