       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEPOSIT.

       DATA DIVISION.

       LINKAGE SECTION.

       01 LK-BALANCE     PIC S9(09)V99.
       01 LK-AMOUNT      PIC S9(09)V99.

       PROCEDURE DIVISION USING LK-BALANCE LK-AMOUNT.

           ADD LK-AMOUNT TO LK-BALANCE

           GOBACK.